In [2]:
import pandas as pd
import numpy as np
from numpy.random import randn
from pandas import Series, DataFrame

In [4]:
ser = Series(randn(6),index=[[1,1,1,2,2,2],['a','b','c','a','b','c']])

In [5]:
ser

1  a   -0.330526
   b    0.811383
   c   -0.084525
2  a    1.502272
   b    1.009075
   c   -0.732016
dtype: float64

In [7]:
ser.index

MultiIndex(levels=[[1, 2], [u'a', u'b', u'c']],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [8]:
ser[1]

a   -0.330526
b    0.811383
c   -0.084525
dtype: float64

In [9]:
ser[2]

a    1.502272
b    1.009075
c   -0.732016
dtype: float64

In [10]:
ser[:,'a']

1   -0.330526
2    1.502272
dtype: float64

In [11]:
dframe = ser.unstack()

In [12]:
dframe

          a         b         c
1 -0.330526  0.811383 -0.084525
2  1.502272  1.009075 -0.732016

In [22]:
dframe2 = DataFrame(np.arange(16).reshape(4,4),index=[['a','a','b','b'],[1,2,3,4]],
                   columns = [['NY','NY','LA','SF'],['Cold','Hot','Hot','Cold']])

In [23]:
dframe2

      NY      LA   SF
    Cold Hot Hot Cold
a 1    0   1   2    3
  2    4   5   6    7
b 3    8   9  10   11
  4   12  13  14   15

In [24]:
dframe2.index.names = ['INDEX_1','INDEX_2']

dframe2.columns.names = ['Cities','Temp']

In [25]:
dframe2

Cities            NY      LA   SF
Temp            Cold Hot Hot Cold
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       3          8   9  10   11
        4         12  13  14   15

In [30]:
dframe2.sort_index(1)

Cities           LA   NY       SF
Temp            Hot Cold Hot Cold
INDEX_1 INDEX_2
a       1         2    0   1    3
        2         6    4   5    7
b       3        10    8   9   11
        4        14   12  13   15

In [31]:
dframe2.sum(level='Temp',axis=1)

Temp             Cold  Hot
INDEX_1 INDEX_2
a       1           3    3
        2          11   11
b       3          19   19
        4          27   27